particle-iot/device-os/hal/src/nRF52840/usb_hal_cdc.c
/*
 * Copyright (c) 2018 Particle Industries, Inc.  All rights reserved.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation, either
 * version 3 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, see <http://www.gnu.org/licenses/>.
 */

#include "logging.h"
LOG_SOURCE_CATEGORY("hal.usb.cdc");

#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdio.h>

#include "nrf.h"
#include "nrf_drv_usbd.h"
#include "nrf_drv_clock.h"
#include "nrf_gpio.h"
#include "nrf_delay.h"
#include "nrf_drv_power.h"

#include "app_error.h"
#include "app_util.h"
#include "app_usbd_core.h"
#include "app_usbd.h"
#include "app_usbd_string_desc.h"
#include "app_usbd_cdc_acm.h"
#include "app_usbd_serial_num.h"
#include "app_fifo.h"
#include "usb_hal_cdc.h"
#include "deviceid_hal.h"
#include "bytes2hexbuf.h"
#include "hal_platform.h"
#include "system_error.h"
#include "interrupts_hal.h"
#include "check.h"
#include "usb_hal_private.h"
#include "usart_hal_private.h"

/**
 * @brief Enable power USB detection
 *
 * Configure if example supports USB port connection
 */
#ifndef USBD_POWER_DETECTION
#define USBD_POWER_DETECTION true
#endif

#define CDC_ACM_COMM_INTERFACE  0
#define CDC_ACM_COMM_EPIN       NRF_DRV_USBD_EPIN2

#define CDC_ACM_DATA_INTERFACE  1
#define CDC_ACM_DATA_EPIN       NRF_DRV_USBD_EPIN1
#define CDC_ACM_DATA_EPOUT      NRF_DRV_USBD_EPOUT1

#define MAX_USB_STATE_CB_NUM    1

extern uint8_t g_extern_serial_number[SERIAL_NUMBER_STRING_SIZE + 1];

typedef enum {
     USB_MODE_NONE,
     USB_MODE_CDC_UART,
     USB_MODE_HID
} usb_mode_t;

typedef struct {
    bool                    initialized;
    volatile HAL_USB_State  state;
    usb_mode_t              mode;

    app_fifo_t              rx_fifo;
    app_fifo_t              tx_fifo;

    volatile bool           com_opened;
    volatile bool           transmitting;
    volatile uint32_t       tx_failed;
    volatile uint32_t       rx_data_size;
    volatile bool           rx_done;
    volatile bool           rx_state;

    void (*bit_rate_changed_handler)(uint32_t bitRate);
    HAL_USB_State_Callback  state_callback[MAX_USB_STATE_CB_NUM];
    void*                   state_callback_context[MAX_USB_STATE_CB_NUM];

    volatile bool enabled;
    EventGroupHandle_t ev_group;
} usb_instance_t;

static usb_instance_t m_usb_instance = {0};

// Rx buffer length must by multiple of NRF_DRV_USBD_EPSIZE.
#define READ_SIZE       (NRF_DRV_USBD_EPSIZE * 2)
static char m_rx_buffer[READ_SIZE];
#define SEND_SIZE       NRF_DRV_USBD_EPSIZE
static char             m_tx_buffer[SEND_SIZE];

static void cdc_acm_user_ev_handler(app_usbd_class_inst_t const * p_inst,
                                    app_usbd_cdc_acm_user_event_t event);
/**
 * @brief CDC_ACM class instance
 * */
APP_USBD_CDC_ACM_GLOBAL_DEF(m_app_cdc_acm,
                            cdc_acm_user_ev_handler,
                            CDC_ACM_COMM_INTERFACE,
                            CDC_ACM_DATA_INTERFACE,
                            CDC_ACM_COMM_EPIN,
                            CDC_ACM_DATA_EPIN,
                            CDC_ACM_DATA_EPOUT,
                            APP_USBD_CDC_COMM_PROTOCOL_AT_V250
);

#define FIFO_LENGTH(p_fifo)     fifo_length(p_fifo)  /**< How much data is currently in the fifo. */
#define IS_FIFO_FULL(p_fifo)    fifo_full(p_fifo)
static __INLINE uint32_t fifo_length(app_fifo_t * p_fifo) {
    uint32_t tmp = p_fifo->read_pos;
    return p_fifo->write_pos - tmp;
}
static __INLINE bool fifo_full(app_fifo_t * p_fifo) {
    return (FIFO_LENGTH(p_fifo) > p_fifo->buf_size_mask);
}

static void reset_rx_tx_state(void) {
    m_usb_instance.rx_done = false;
    m_usb_instance.rx_data_size = 0;
    m_usb_instance.transmitting = false;
    m_usb_instance.tx_failed = 0;
    m_usb_instance.rx_state = false;
    app_fifo_flush(&m_usb_instance.tx_fifo);
    app_fifo_flush(&m_usb_instance.rx_fifo);
}

static void set_usb_state(HAL_USB_State state) {
    if (m_usb_instance.state != state) {
        m_usb_instance.state = state;
        for (int i = 0; i < MAX_USB_STATE_CB_NUM; i++) {
            if (m_usb_instance.state_callback[i]) {
                (*m_usb_instance.state_callback[i])(state, m_usb_instance.state_callback_context[i]);
            } else {
                break;
            }
        }
    }
}

static bool usb_cdc_copy_from_rx_buffer() {
    if (m_usb_instance.rx_done && (FIFO_LENGTH(&m_usb_instance.rx_fifo) + m_usb_instance.rx_data_size) <= m_usb_instance.rx_fifo.buf_size_mask) {
        // Receive data into buffer
        uint32_t rx_size = m_usb_instance.rx_data_size;
        SPARK_ASSERT(app_fifo_write(&m_usb_instance.rx_fifo, (uint8_t*)m_rx_buffer, &rx_size) == NRF_SUCCESS);
        return true;
    }

    return false;
}

static bool usb_cdc_handle_rx() {
    m_usb_instance.rx_data_size = app_usbd_cdc_acm_rx_size(&m_app_cdc_acm);
    m_usb_instance.rx_done = true;
    m_usb_instance.rx_state = false;

    if (m_usb_instance.rx_data_size == 0 || usb_cdc_copy_from_rx_buffer()) {
        // Reset receive status
        m_usb_instance.rx_done = false;
        m_usb_instance.rx_data_size = 0;

        return true;
    }

    return false;
}

static void usb_cdc_schedule_rx() {
    if (m_usb_instance.com_opened && !m_usb_instance.rx_state && !m_usb_instance.rx_done) {
        // Enforce DTR state, otherwise the Nordic SDK
        // will disallow us to schedule any transfers in the closed state
        uint32_t cache = m_app_cdc_acm.specific.p_data->ctx.line_state;
        m_app_cdc_acm.specific.p_data->ctx.line_state |= APP_USBD_CDC_ACM_LINE_STATE_DTR;
        ret_code_t r = app_usbd_cdc_acm_read_any(&m_app_cdc_acm, m_rx_buffer, READ_SIZE);
        if (r == NRF_ERROR_IO_PENDING) {
            m_usb_instance.rx_data_size = 0;
            m_usb_instance.rx_done = false;
            m_usb_instance.rx_state = true;
        } else if (r == NRF_SUCCESS) {
            // Data has already been stored into the RX buffer
            usb_cdc_handle_rx();
        }
        m_app_cdc_acm.specific.p_data->ctx.line_state = cache;
    }
}

