particle-iot/device-os/hal/src/nRF52840/usb_hal_cdc.c
static void usb_cdc_change_port_state(bool state)
{
    if (state != m_usb_instance.com_opened) {
        m_usb_instance.com_opened = state;

        if (state) {
            app_fifo_flush(&m_usb_instance.tx_fifo);
            m_app_cdc_acm.specific.p_data->ctx.line_state |= APP_USBD_CDC_ACM_LINE_STATE_DTR;
            usb_cdc_schedule_rx();
        } else {
            // When going into closed state Nordic SDK
            // aborts transfers!
            m_usb_instance.tx_failed = 0;
            m_usb_instance.transmitting = false;
            xEventGroupSetBits(m_usb_instance.ev_group, HAL_USART_PVT_EVENT_WRITABLE);
        }
    }
}

static void usb_cdc_schedule_tx() {
    uint32_t cache = m_app_cdc_acm.specific.p_data->ctx.line_state;
    if (m_usb_instance.com_opened && m_usb_instance.transmitting &&
            m_usb_instance.tx_failed++ >= HAL_PLATFORM_USB_CDC_TX_FAIL_TIMEOUT_MS) {
        // Failed to transmit (probably lost host)
        // Make sure to cancel ongoing transfer
        nrf_drv_usbd_ep_abort(CDC_ACM_DATA_EPIN);
        m_usb_instance.transmitting = false;
        usb_cdc_change_port_state(false);
        // Send ZLP, otherwise the Nordic SDK
        // will disallow us to schedule any transfers in the closed state
        m_app_cdc_acm.specific.p_data->ctx.line_state |= APP_USBD_CDC_ACM_LINE_STATE_DTR;
        app_usbd_cdc_acm_write(&m_app_cdc_acm, m_tx_buffer, 0);
        m_app_cdc_acm.specific.p_data->ctx.line_state = cache;
    }

    if (m_usb_instance.com_opened && !m_usb_instance.transmitting && FIFO_LENGTH(&m_usb_instance.tx_fifo) > 0) {
        uint32_t to_send = SEND_SIZE;
        app_fifo_read(&m_usb_instance.tx_fifo, (uint8_t*)m_tx_buffer, &to_send);

        m_usb_instance.tx_failed = 0;
        m_app_cdc_acm.specific.p_data->ctx.line_state |= APP_USBD_CDC_ACM_LINE_STATE_DTR;
        if (app_usbd_cdc_acm_write(&m_app_cdc_acm, m_tx_buffer, to_send) == NRF_SUCCESS) {
            m_usb_instance.transmitting = true;
        }
        m_app_cdc_acm.specific.p_data->ctx.line_state = cache;
    }
}

/**
 * @brief User event handler @ref app_usbd_cdc_acm_user_ev_handler_t (headphones)
 * */
static void cdc_acm_user_ev_handler(app_usbd_class_inst_t const * p_inst,
                                    app_usbd_cdc_acm_user_event_t event)
{
    BaseType_t yield = pdFALSE;
    bool eventGenerated = false;

    switch (event) {
        case APP_USBD_CDC_ACM_USER_EVT_SET_LINE_CODING: {
            if (m_usb_instance.bit_rate_changed_handler) {
                (*m_usb_instance.bit_rate_changed_handler)(usb_uart_get_baudrate());
            }
            break;
        }
        case APP_USBD_CDC_ACM_USER_EVT_PORT_OPEN: {
            // Remote side asserted DTR
            usb_cdc_change_port_state(true);
            break;
        }
        case APP_USBD_CDC_ACM_USER_EVT_PORT_CLOSE: {
            // Remote side deasserted DTR
            // NOTE: Nordic SDK will abort any outstanding RX/TX transfers.
            m_usb_instance.rx_state = false;
            usb_cdc_change_port_state(false);
            eventGenerated = true;
            break;
        }
        case APP_USBD_CDC_ACM_USER_EVT_TX_DONE: {
            m_usb_instance.transmitting = false;
            m_usb_instance.tx_failed = 0;

            // We are definitely open
            usb_cdc_change_port_state(true);

            usb_cdc_schedule_tx();

            if (usb_uart_available_tx_data() > 0) {
                xEventGroupSetBitsFromISR(m_usb_instance.ev_group, HAL_USART_PVT_EVENT_WRITABLE, &yield);
                eventGenerated = true;
            }
            break;
        }
        case APP_USBD_CDC_ACM_USER_EVT_RX_DONE: {
            // We are definitely open
            usb_cdc_change_port_state(true);

            if (usb_cdc_handle_rx()) {
                // Setup next transfer.
                usb_cdc_schedule_rx();
            }
            // Always notify readable if there is data in the FIFO or pending in rx buffer
            if (FIFO_LENGTH(&m_usb_instance.rx_fifo) > 0 || m_usb_instance.rx_done) {
                xEventGroupSetBitsFromISR(m_usb_instance.ev_group, HAL_USART_PVT_EVENT_READABLE, &yield);
                eventGenerated = true;
            }
            break;
        }
        default:
            break;
    }

    if (eventGenerated) {
        portYIELD_FROM_ISR(yield);    
    }
}

static HAL_USB_State nrf_usb_state_to_hal_usb_state(app_usbd_state_t state) {
    switch (state) {
        case APP_USBD_STATE_Disabled: {
            return HAL_USB_STATE_DISABLED;
        }
        case APP_USBD_STATE_Unattached: {
            return HAL_USB_STATE_DETACHED;
        }
        case APP_USBD_STATE_Powered: {
            return HAL_USB_STATE_POWERED;
        }
        case APP_USBD_STATE_Default: {
            return HAL_USB_STATE_DEFAULT;
        }
        case APP_USBD_STATE_Addressed: {
            return HAL_USB_STATE_ADDRESSED;
        }
        case APP_USBD_STATE_Configured: {
            return HAL_USB_STATE_CONFIGURED;
        }
        default: {
            return HAL_USB_STATE_NONE;
        }
    }
}

static void usbd_user_ev_handler(app_usbd_event_type_t event)
{
    switch (event) {
        case APP_USBD_EVT_DRV_SOF: {
            usb_cdc_schedule_rx();
            usb_cdc_schedule_tx();
            break;
        }
        case APP_USBD_EVT_DRV_SUSPEND: {
            set_usb_state(HAL_USB_STATE_SUSPENDED);
            usb_cdc_change_port_state(false);
            nrf_drv_usbd_ep_abort(CDC_ACM_DATA_EPIN);
            nrf_drv_usbd_ep_abort(CDC_ACM_DATA_EPOUT);
            m_usb_instance.transmitting = false;
            m_usb_instance.rx_state = false;
            // Required so that we can restart rx transfers after waking up
            m_app_cdc_acm.specific.p_data->ctx.rx_transfer[0].p_buf = NULL;
            m_app_cdc_acm.specific.p_data->ctx.rx_transfer[1].p_buf = NULL;
            m_app_cdc_acm.specific.p_data->ctx.bytes_left = 0;
            m_app_cdc_acm.specific.p_data->ctx.bytes_read = 0;
            m_app_cdc_acm.specific.p_data->ctx.last_read = 0;
            m_app_cdc_acm.specific.p_data->ctx.cur_read = 0;
            m_app_cdc_acm.specific.p_data->ctx.p_copy_pos = m_app_cdc_acm.specific.p_data->ctx.internal_rx_buf;
            // IMPORTANT! Otherwise the state machine will fail
            // to come out of the suspended state
            app_usbd_suspend_req();
            break;
        }
        case APP_USBD_EVT_DRV_RESUME: {
            set_usb_state(nrf_usb_state_to_hal_usb_state(app_usbd_core_state_get()));
            if (m_app_cdc_acm.specific.p_data->ctx.line_state & APP_USBD_CDC_ACM_LINE_STATE_DTR) {
                usb_cdc_change_port_state(true);
            }
            break;
        }
        case APP_USBD_EVT_START_REQ: {
            set_usb_state(HAL_USB_STATE_DETACHED);
            break;
        }
        case APP_USBD_EVT_STARTED: {
            // triggered by app_usbd_start()

            reset_rx_tx_state();
            set_usb_state(nrf_usb_state_to_hal_usb_state(app_usbd_core_state_get()));
            break;
        }
        case APP_USBD_EVT_STOPPED: {
            // triggered by app_usbd_stop()
            app_usbd_disable();
            if (m_usb_instance.enabled) {
                set_usb_state(HAL_USB_STATE_DETACHED);
            } else {
                set_usb_state(HAL_USB_STATE_DISABLED);
            }
            break;
        }
        case APP_USBD_EVT_POWER_DETECTED: {
            if (!nrf_drv_usbd_is_enabled()) {
                app_usbd_enable();
            }
            break;
        }
        case APP_USBD_EVT_POWER_REMOVED: {
            // We need to check for nrfx_usbd_is_enabled() in order not to accidentally
            // trigger an assertion
            if (nrfx_usbd_is_enabled()) {
                app_usbd_stop();
            } else if (m_usb_instance.enabled) {
                // Just in case go into detached state
                set_usb_state(HAL_USB_STATE_DETACHED);
            }
            m_usb_instance.rx_state = false;
            usb_cdc_change_port_state(false);
            break;
        }
        case APP_USBD_EVT_DRV_RESET: {
            // Nordic CDC driver willl silently abort transfers
            m_usb_instance.rx_state = false;
            usb_cdc_change_port_state(false);
            break;
        }
        case APP_USBD_EVT_POWER_READY: {
            if (m_usb_instance.enabled) {
                app_usbd_start();
            }
            break;
        }
        case APP_USBD_EVT_STATE_CHANGED: {
            set_usb_state(nrf_usb_state_to_hal_usb_state(app_usbd_core_state_get()));
            break;
        }
        default:
            break;
    }
}

static bool usb_will_preempt(void)
{
    // Ain't no one is preempting us if interrupts are currently disabled or basepri masked
    if (hal_interrupt_is_irq_masked(USBD_IRQn) || nrf_nvic_state.__cr_flag) {
        return false;
    }

    if (hal_interrupt_is_isr()) {
        if (!hal_interrupt_will_preempt(USBD_IRQn, hal_interrupt_serviced_irqn())) {
            return false;
        }
    }

