particle-iot/device-os/hal/src/nRF52840/usb_hal_cdc.c
    return true;
}

int usb_hal_init(void) {
    if (m_usb_instance.initialized) {
        return 0;
    }

    ret_code_t ret;
    static const app_usbd_config_t usbd_config = {
        .ev_state_proc = usbd_user_ev_handler
    };

    ret = nrf_drv_clock_init();
    if (ret != NRF_ERROR_MODULE_ALREADY_INITIALIZED) {
        SPARK_ASSERT(ret == NRF_SUCCESS);
    }

    nrf_drv_clock_lfclk_request(NULL);
    while(!nrf_drv_clock_lfclk_is_running()) {
        /* Just waiting */
    }

    // Create USB Serial string by Device ID
    uint8_t device_id[HAL_DEVICE_ID_SIZE] = {};
    uint8_t device_id_len = hal_get_device_id(device_id, sizeof(device_id));
    memset(g_extern_serial_number, 0, sizeof(g_extern_serial_number));
    bytes2hexbuf_lower_case(device_id, MIN(device_id_len, sizeof(g_extern_serial_number) - 1), g_extern_serial_number);

    ret = app_usbd_init(&usbd_config);
    SPARK_ASSERT(ret == NRF_SUCCESS);

    m_usb_instance.initialized = true;

    return 0;
}

static int usb_uart_deinit(void) {
    if (m_usb_instance.mode != USB_MODE_CDC_UART) {
      return 0;
    }

    usb_hal_detach();

    // Ensure USBD is fully stopped and disabled
    if (nrfx_usbd_is_enabled()) {
      app_usbd_stop();
    }
    if (nrf_drv_usbd_is_enabled()) {
      app_usbd_disable();
    }

    // Unregister SOF and remove CDC ACM class instance (must be done when USBD is disabled)
    app_usbd_class_inst_t const * class_cdc_acm = app_usbd_cdc_acm_class_inst_get(&m_app_cdc_acm);
    app_usbd_class_sof_unregister(class_cdc_acm);
    app_usbd_class_remove(class_cdc_acm);

#if HAL_PLATFORM_USB_CONTROL_INTERFACE
    extern int hal_usb_control_interface_deinit(void* reserved);
    hal_usb_control_interface_deinit(NULL);
#endif

    if (m_usb_instance.ev_group) {
      vEventGroupDelete(m_usb_instance.ev_group);
      m_usb_instance.ev_group = NULL;
    }

    // Reset mode so usb_uart_init() can run again
    m_usb_instance.mode = USB_MODE_NONE;

    return 0;
}

int usb_uart_init(uint8_t *rx_buf, uint16_t rx_buf_size, uint8_t *tx_buf, uint16_t tx_buf_size, bool default_buffers) {
    uint32_t ret;

    if (m_usb_instance.mode == USB_MODE_CDC_UART) {
        if (default_buffers) {
            return -1;
        }
        usb_uart_deinit();
    }

    if (app_fifo_init(&m_usb_instance.rx_fifo, rx_buf, rx_buf_size)) {
        return -1;
    }

    if (app_fifo_init(&m_usb_instance.tx_fifo, tx_buf, tx_buf_size)) {
        return -2;
    }

    app_usbd_class_inst_t const * class_cdc_acm = app_usbd_cdc_acm_class_inst_get(&m_app_cdc_acm);
    ret = app_usbd_class_append(class_cdc_acm);
    SPARK_ASSERT(ret == NRF_SUCCESS);

    // We'd like to receive SOF events
    app_usbd_class_sof_register(class_cdc_acm);

    // FIXME: this should not be handled in here, but for now in order to ensure that
    // the control interface is always at interface #2, we do it here
    extern int hal_usb_control_interface_init(void* reserved);
#if HAL_PLATFORM_USB_CONTROL_INTERFACE
    hal_usb_control_interface_init(NULL);
#endif // HAL_PLATFORM_USB_CONTROL_INTERFACE

    if (USBD_POWER_DETECTION) {
        ret = app_usbd_power_events_enable();
        SPARK_ASSERT(ret == NRF_SUCCESS);
    } else {
        app_usbd_enable();
        app_usbd_start();
    }

    m_usb_instance.mode = USB_MODE_CDC_UART;
    m_usb_instance.ev_group = xEventGroupCreate();
    SPARK_ASSERT(m_usb_instance.ev_group);

    return 0;
}

int usb_uart_send(const uint8_t data[], uint16_t size) {
    if (m_usb_instance.state != HAL_USB_STATE_CONFIGURED || !m_usb_instance.com_opened) {
        return -1;
    }

    uint32_t bytesRemaining = size;
    while (bytesRemaining) {
        // wait until tx fifo is available
        while (IS_FIFO_FULL(&m_usb_instance.tx_fifo)) {
            if (!usb_hal_is_connected() || !usb_will_preempt()) {
                return -1;
            }
        }
        uint32_t bytesToWrite = bytesRemaining;
        SPARK_ASSERT(app_fifo_write(&m_usb_instance.tx_fifo, data + (size - bytesRemaining), &bytesToWrite) == NRF_SUCCESS);
        bytesRemaining -= bytesToWrite;
    }

    // NOTE: we only care and report about how many bytes were actually put into the transmit buffer
    return size;
}

void usb_uart_set_baudrate(uint32_t baudrate) {
    app_usbd_class_inst_t const * cdc_inst_class = app_usbd_cdc_acm_class_inst_get(&m_app_cdc_acm);
    app_usbd_cdc_acm_t const *cdc_acm_class= app_usbd_cdc_acm_class_get(cdc_inst_class);

    if ((cdc_acm_class != NULL) && (cdc_acm_class->specific.p_data != NULL)) {
        *(uint32_t *)cdc_acm_class->specific.p_data->ctx.line_coding.dwDTERate = baudrate;
    }
}

uint32_t usb_uart_get_baudrate(void) {
    app_usbd_class_inst_t const * cdc_inst_class = app_usbd_cdc_acm_class_inst_get(&m_app_cdc_acm);
    app_usbd_cdc_acm_t const *cdc_acm_class= app_usbd_cdc_acm_class_get(cdc_inst_class);

    if ((cdc_acm_class != NULL) && (cdc_acm_class->specific.p_data != NULL)) {
        return uint32_decode(cdc_acm_class->specific.p_data->ctx.line_coding.dwDTERate);
    }

    return 0;
}

void usb_hal_attach(void) {
    if (m_usb_instance.enabled) {
        return;
    }

    m_usb_instance.enabled = true;

    set_usb_state(HAL_USB_STATE_DETACHED);

    reset_rx_tx_state();
    usb_cdc_change_port_state(false);

    if (!nrf_drv_usbd_is_enabled()) {
        app_usbd_enable();
    }
    app_usbd_start();
}

void usb_hal_detach(void) {
    if (!m_usb_instance.enabled) {
        return;
    }

    m_usb_instance.enabled = false;

    // We need to check for nrfx_usbd_is_enabled() in order not to accidentally
    // trigger an assertion
    if (nrfx_usbd_is_enabled()) {
        app_usbd_stop();
    }
    if (nrf_drv_usbd_is_enabled()) {
        app_usbd_disable();
    }

    // Go to disabled state just in case
    set_usb_state(HAL_USB_STATE_DISABLED);

    reset_rx_tx_state();
    usb_cdc_change_port_state(false);
}

int usb_uart_available_rx_data(void) {
    return FIFO_LENGTH(&m_usb_instance.rx_fifo) + m_usb_instance.rx_data_size;
}

uint8_t usb_uart_get_rx_data(void) {
    if (usb_cdc_copy_from_rx_buffer()) {
        m_usb_instance.rx_data_size = 0;
        m_usb_instance.rx_done = false;
    }

