particle-iot/device-os/hal/src/nRF52840/usb_hal_cdc.c
    uint8_t data = 0;
    if (FIFO_LENGTH(&m_usb_instance.rx_fifo)) {
        SPARK_ASSERT(app_fifo_get(&m_usb_instance.rx_fifo, &data) == NRF_SUCCESS);
    }

    return data;
}

uint8_t usb_uart_peek_rx_data(uint8_t index) {
    uint8_t data = 0;
    if (app_fifo_peek(&m_usb_instance.rx_fifo, index, &data)) {
        return 0;
    }
    return data;
}

int usb_uart_peek_rx_buffer(uint8_t* buffer, size_t size) {
    if (usb_cdc_copy_from_rx_buffer()) {
        m_usb_instance.rx_data_size = 0;
        m_usb_instance.rx_done = false;
    }

    size_t available = FIFO_LENGTH(&m_usb_instance.rx_fifo);
    if (size > available) {
        size = available;
    }
    for (size_t i = 0; i < size; i++) {
        if (app_fifo_peek(&m_usb_instance.rx_fifo, (uint16_t)i, &buffer[i])) {
            return i;
        }
    }
    return size;
}

void usb_uart_flush_rx_data(void) {
    app_fifo_flush(&m_usb_instance.rx_fifo);
}

void usb_uart_flush_tx_data(void) {
    if (!usb_will_preempt()) {
        return;
    }
    while(usb_hal_is_connected() && FIFO_LENGTH(&m_usb_instance.tx_fifo) != 0 && m_usb_instance.transmitting) {
        // Wait
    }
}

int usb_uart_available_tx_data(void) {
    if (usb_hal_is_connected()) {
        return m_usb_instance.tx_fifo.buf_size_mask - FIFO_LENGTH(&m_usb_instance.tx_fifo) + 1;
    }
    return -1;
}

bool usb_hal_is_enabled(void) {
    return m_usb_instance.enabled;
}

bool usb_hal_is_connected(void) {
    return m_usb_instance.com_opened;
}

void usb_hal_set_bit_rate_changed_handler(void (*handler)(uint32_t bitRate)) {
    m_usb_instance.bit_rate_changed_handler = handler;
}

HAL_USB_State usb_hal_get_state() {
    return m_usb_instance.state;
}

static void dummy_state_change_handler(HAL_USB_State state, void* context) {
    (void)state;
    (void)context;
}

int usb_hal_set_state_change_callback(HAL_USB_State_Callback cb, void* context, void* reserved) {
    for (int i = 0; i < MAX_USB_STATE_CB_NUM; i++) {
        if (m_usb_instance.state_callback[i] == NULL) {
            // FIXME: a weird way to resolve a race condition between cb and context setting
            m_usb_instance.state_callback[i] = dummy_state_change_handler;
            m_usb_instance.state_callback_context[i] = context;
            m_usb_instance.state_callback[i] = cb;
            return 0;
        }
    }
    return SYSTEM_ERROR_NO_MEMORY;
}

static int enableEvent(HAL_USART_Pvt_Events event) {
    if (event & HAL_USART_PVT_EVENT_READABLE) {
        if (usb_uart_available_rx_data() > 0) {
            xEventGroupSetBits(m_usb_instance.ev_group, HAL_USART_PVT_EVENT_READABLE);
        }
    }

    if (event & HAL_USART_PVT_EVENT_WRITABLE) {
        if (usb_uart_available_tx_data() > 0) {
            xEventGroupSetBits(m_usb_instance.ev_group, HAL_USART_PVT_EVENT_WRITABLE);
        }
    }

    return SYSTEM_ERROR_NONE;
}

static int waitEvent(uint32_t events, system_tick_t timeout) {
    CHECK_FALSE(enableEvent((HAL_USART_Pvt_Events)events), SYSTEM_ERROR_INVALID_STATE);
    return xEventGroupWaitBits(m_usb_instance.ev_group, events, pdTRUE, pdFALSE, timeout / portTICK_RATE_MS);
}

int hal_usb_cdc_pvt_get_event_group_handle(EventGroupHandle_t* handle) {
    CHECK_TRUE(m_usb_instance.ev_group, SYSTEM_ERROR_INVALID_STATE);
    *handle = m_usb_instance.ev_group;
    return SYSTEM_ERROR_NONE;
}

int hal_usb_cdc_pvt_wait_event(uint32_t events, system_tick_t timeout) {
    return waitEvent(events, timeout);
}

int hal_usb_cdc_pvt_send_data(const char* data, size_t size) {
    if (m_usb_instance.state != HAL_USB_STATE_CONFIGURED || !m_usb_instance.com_opened) {
        return -1;
    }

    uint32_t bytesToWrite = size;
    uint32_t result = app_fifo_write(&m_usb_instance.tx_fifo, data, &bytesToWrite);
    if (result == NRF_ERROR_NO_MEM) {
        return SYSTEM_ERROR_NO_MEMORY;
    }
    SPARK_ASSERT(result == NRF_SUCCESS);

    // NOTE: its possible to only write part of the data. WRITABLE will need to be signaled to complete transmission
    return bytesToWrite;
}

int hal_usb_cdc_pvt_recv_data(char* data, size_t size) {
    if (usb_cdc_copy_from_rx_buffer()) {
        m_usb_instance.rx_data_size = 0;
        m_usb_instance.rx_done = false;
    }

    if (data == NULL) {
        // app_fifo_read() with a NULL buffer only queries the length without consuming
        uint32_t to_skip = FIFO_LENGTH(&m_usb_instance.rx_fifo);
        if (to_skip > size) {
            to_skip = size;
        }
        m_usb_instance.rx_fifo.read_pos += to_skip;
        return to_skip;
    }

    uint32_t to_read = size;
    if (app_fifo_read(&m_usb_instance.rx_fifo, (uint8_t*)data, &to_read) == NRF_SUCCESS) {
        return to_read;
    }

    return 0;
}
